Repository: 365businessdev/bc-data-exchange-framework
Catalog: app/translations/Data Exchange Framework Extension.*.xlf
Languages: de_de

# Codeunit 918078992 - NamedType 1759761666
source: The %1 column is mapped in the %2 format to a %3 field, which is not supported.
de_de: Die Spalte „%1“ ist im Format „%2“ einem nicht unterstützen Feld des Typs „%3“ zugeordnet.

# Codeunit 918078992 - NamedType 4204626662
source: The file that you are trying to import, %1, is different from the specified %2, %3.\\The value in line %4, column %5 has incorrect format or type.\Expected format: %6, according to the %7 and %8 of the %9.\Actual value: "%10".
de_de: Die Datei „%1“, die Sie zu importieren versuchen, unterscheidet sich von der angegebenen %2, %3.\\Der Wert in Zeile %4, Spalte %5 liegt im falschen Format oder Typ vor.\Erwartetes Format: %6, gemäß %7 und %8 von %9.\Tatsächlicher Wert: „%10“.

# Codeunit 3067624366 - Method 2197396733 - NamedType 2549511956
source: Please wait while the operation is being completed . . .
de_de: Bitte warten Sie, während der Vorgang abgeschlossen wird . . .

# Codeunit 3067624366 - Method 1911523748 - NamedType 2619509798
source: Started at: %1
de_de: Gestartet: %1

# Codeunit 3067624366 - Method 1911523748 - NamedType 105583867
source: Finished at: %1
de_de: Beendet: %1

# Codeunit 3067624366 - Method 1911523748 - NamedType 3831870363
source: Duration: %1
de_de: Dauer: %1

# Codeunit 3067624366 - Method 1911523748 - NamedType 2276224071
source: No. of imported Lines: %1
de_de: Anzahl der importierten Zeilen: %1

# Codeunit 3580188444 - Method 1395469759 - NamedType 2814453662
source: The file that you are trying to import, %1, is different from the specified %2, %3.\\The value in line %4, column %5 is missing.
de_de: Die Datei %1, die Sie zu importieren versuchen, unterscheidet sich von der angegebenen %2, %3.\\Der Wert in Zeile %4, Spalte %5 fehlt.

# Codeunit 3580188444 - Method 1395469759 - NamedType 2844206611
source: The field mapping for Data Exchange Definition %1, Line Definition %2 and Table ID %3 is missing.\\Please verify set up and try again.
de_de: Die Feldzuordnung für die Datenaustauschdefinition %1, die Zeilendefinition %2 und die Tabellen-ID %3 fehlt.\\Bitte überprüfen Sie die Einrichtung und versuchen Sie es erneut.

# Page 2409193875 - Property 2879900210
source: Data Exchange Data View
de_de: Datenaustausch Datenansicht

# Page 2409193875 - NamedType 192661248
source: This page must be initialized by passing a valid Data Exch. Def. Record.
de_de: Die Seite muss durch die Übergabe einer Datenaustauschdefinition initialisiert werden.

# Page 2409193875 - Method 2383333346 - NamedType 2609342416
source: Started at: %1
de_de: Gestartet: %1

# Page 2409193875 - Method 2383333346 - NamedType 2038369561
source: Finished at: %1
de_de: Beendet: %1

# Page 2409193875 - Method 2383333346 - NamedType 904595705
source: Duration: %1
de_de: Dauer: %1

# Page 2409193875 - Control 4257037292 - Property 1295455071
source: Specifies the value of Column 1 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 2262753188 - Property 1295455071
source: Specifies the value of Column 10 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 1625056571 - Property 1295455071
source: Specifies the value of Column 11 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 3538146422 - Property 1295455071
source: Specifies the value of Column 12 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 2900449805 - Property 1295455071
source: Specifies the value of Column 13 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 4006934016 - Property 1295455071
source: Specifies the value of Column 14 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 3369237399 - Property 1295455071
source: Specifies the value of Column 15 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 987359954 - Property 1295455071
source: Specifies the value of Column 16 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 349663337 - Property 1295455071
source: Specifies the value of Column 17 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 1456147548 - Property 1295455071
source: Specifies the value of Column 18 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 818450931 - Property 1295455071
source: Specifies the value of Column 19 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 599766613 - Property 1295455071
source: Specifies the value of Column 2 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 2539285461 - Property 1295455071
source: Specifies the value of Column 20 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 1237463230 - Property 1295455071
source: Specifies the value of Column 3 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 1068554207 - Property 1295455071
source: Specifies the value of Column 4 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 1706250824 - Property 1295455071
source: Specifies the value of Column 5 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 2343947441 - Property 1295455071
source: Specifies the value of Column 6 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 2981644058 - Property 1295455071
source: Specifies the value of Column 7 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 130979019 - Property 1295455071
source: Specifies the value of Column 8 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Control 768675636 - Property 1295455071
source: Specifies the value of Column 9 from the Data Exch. Column Definition.
de_de: Gibt den Wert der Spalte der Datenaustauschspaltendefinition an.

# Page 2409193875 - Action 2751643373 - Property 1295455071
source: Run the specified Data Handling Codeunit to process the data.
de_de: Führt die angegebene Codeunit zur Datenverarbeitung aus, um die Daten zu verarbeiten.

# Page 2409193875 - Action 2751643373 - Property 2879900210
source: Process Data
de_de: Daten verarbeiten

# Page 754695306 - Property 2879900210
source: Data Exchange List
de_de: Datenaustauschliste

# Page 754695306 - Control 883711285 - Property 1295455071
source: Specifies the Entry No. of the Data Exchange.
de_de: Gibt die Lfd. Nr. für den Datenaustausch an.

# Page 754695306 - Control 804481195 - Property 1295455071
source: Specifies the File Name of the Data Exchange.
de_de: Gibt die Dateinamen für den Datenaustausch an.

# Page 754695306 - Control 577209412 - Property 1295455071
source: Specifies the Entry No. of the Data Exchange.
de_de: Gibt die Lfd. Nr. für den Datenaustausch an.

# Page 754695306 - Control 577209412 - Property 2879900210
source: Created at
de_de: Erstellt am

# Page 754695306 - Action 88470173 - Property 1295455071
source: Opens the data view for the currently selected Data Exchange Line Definition.
de_de: Öffnet die Datenansicht für die aktuell ausgewählte Datenaustauschzeilendefinition.

# Page 754695306 - Action 88470173 - Property 2879900210
source: Show Data
de_de: Daten anzeigen

# Report 3965680763 - Property 2879900210
source: Import Data
de_de: Daten importieren

# Report 3965680763 - Control 625997650 - Property 2879900210
source: Data Exchange Definition
de_de: Datenaustauschdefinition

# Report 3965680763 - Control 2325541223 - Property 1295455071
source: Specifies the data exchange definition of the file you want to import into Microsoft Dynamics 365 Business Central.
de_de: Gibt die Datenaustauschdefinition der Datei an, die Sie in Microsoft Dynamics 365 Business Central importieren möchten.

# Report 3965680763 - Control 2325541223 - Property 2879900210
source: Data Exchange Definition
de_de: Datenaustauschdefinition

# Report 3965680763 - Control 3862658188 - Property 2879900210
source: Gen. Journal Selection
de_de: Buch.-Blatt

# Report 3965680763 - Control 691295570 - Property 1295455071
source: Specifies the general journal batch name to import the data into.
de_de: Gibt den Namen des Buch.-Blatt an, in den die Daten importiert werden sollen.

# Report 3965680763 - Control 691295570 - Property 2879900210
source: Gen. Journal Batch
de_de: Buch.-Blattname

# PageExtension 3905202955 - Action 2197396733 - Property 1295455071
source: Start the process of importing a txt or csv file, based on the current generic import definition.
de_de: Startet den Prozess zum Import einer TXT- oder CSV-Datei, basierend auf der aktuellen generischen Importdefinition.

# PageExtension 3905202955 - Action 2197396733 - Property 2879900210
source: Import File
de_de: Datei importieren

# PageExtension 3059613628 - Action 88470173 - Property 1295455071
source: Opens the data view for the currently selected Data Exchange Line Definition.
de_de: Öffnet die Datenansicht für die aktuell ausgewählte Datenaustauschzeilendefinition.

# PageExtension 3059613628 - Action 88470173 - Property 2879900210
source: Show Data
de_de: Daten anzeigen

# TableExtension 3580188444 - Field 1722710769 - Property 2879900210
source: Data Exchange Entry No.
de_de: Datenaustausch Lfd. Nr.
